Revit 2024 API
ExternalServices.BuiltInExternalServices.ModelAccessValidationService Property
 The external service which validates the access to Revit model such as Revit Cloud model.
Namespace: Autodesk.Revit.DB.ExternalService
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ExternalServiceId ModelAccessValidationService { get; }
Visual Basic
Public Shared ReadOnly Property ModelAccessValidationService As ExternalServiceId
	Get
Visual C++
public:
static property ExternalServiceId^ ModelAccessValidationService {
	ExternalServiceId^ get ();
}
See Also
ExternalServices.BuiltInExternalServices Class
Autodesk.Revit.DB.ExternalService Namespace